; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Domain file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain test_domain)
    (:requirements :equality :typing)
    (:types
        physobj - object
        vehicle - physobj
        package - physobj
        airplane - vehicle
        truck - vehicle
        place - object
        location - place
        airport - place
        city - object
    )

    (:constants
        
    )

    (:predicates
        (in-city ?x1 - place ?x2 - city)
        (at ?x1 - physobj ?x2 - place)
        (in ?x1 - package ?x2 - vehicle)
    )

    (:functions
        
    )

    

    
    (:action LOAD-TRUCK
     :parameters (?pkg - package ?truck - truck ?loc - place)
     :precondition (and (at ?truck ?loc) (at ?pkg ?loc))
     :effect (and
        (in ?pkg ?truck)
        (not (at ?pkg ?loc)))
    )


    (:action LOAD-AIRPLANE
     :parameters (?pkg - package ?airplane - airplane ?loc - place)
     :precondition (and (at ?pkg ?loc) (at ?airplane ?loc))
     :effect (and
        (in ?pkg ?airplane)
        (not (at ?pkg ?loc)))
    )


    (:action UNLOAD-TRUCK
     :parameters (?pkg - package ?truck - truck ?loc - place)
     :precondition (and (at ?truck ?loc) (in ?pkg ?truck))
     :effect (and
        (at ?pkg ?loc)
        (not (in ?pkg ?truck)))
    )


    (:action UNLOAD-AIRPLANE
     :parameters (?pkg - package ?airplane - airplane ?loc - place)
     :precondition (at ?airplane ?loc)
     :effect (and
        (at ?pkg ?loc)
        (not (in ?pkg ?airplane)))
    )


    (:action DRIVE-TRUCK
     :parameters (?truck - truck ?loc-from - place ?loc-to - place ?city - city)
     :precondition (and (at ?truck ?loc-from) (in-city ?loc-to ?city))
     :effect (and
        (at ?truck ?loc-to)
        (not (at ?truck ?loc-from)))
    )


    (:action FLY-AIRPLANE
     :parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport)
     :precondition (at ?airplane ?loc-from)
     :effect (and
        (at ?airplane ?loc-to)
        (not (at ?airplane ?loc-from)))
    )

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem instance1)
    (:domain test_domain)

    (:objects
        apn1 - airplane
        apt1 apt2 - airport
        cit1 cit2 - city
        pos1 pos2 - location
        obj11 obj12 obj13 obj21 obj22 obj23 - package
        tru1 tru2 - truck
    )

    (:init
        (at obj22 pos2)
        (at obj23 pos2)
        (at obj21 pos2)
        (at obj11 pos1)
        (at tru2 pos2)
        (at obj13 pos1)
        (at obj12 pos1)
        (at apn1 apt2)
        (at tru1 pos1)
        (in-city apt2 cit2)
        (in-city pos1 cit1)
        (in-city pos2 cit2)
        (in-city apt1 cit1)
    )

    (:goal
        (and (at obj23 pos1) (at obj13 apt1) (at obj11 apt1))
    )

    
    
    
)

; plan
1. (load-truck obj23 tru2 pos2)
   deleted: (at obj23 pos2)
   added: (in obj23 tru2)
   goals met: 0 of 3
2. (load-truck obj21 tru2 pos2)
   deleted: (at obj21 pos2)
   added: (in obj21 tru2)
   goals met: 0 of 3
3. (drive-truck tru2 pos2 pos1 cit1)
   deleted: (at tru2 pos2)
   added: (at tru2 pos1)
   goals met: 0 of 3
4. (unload-truck obj23 tru2 pos1)
   deleted: (in obj23 tru2)
   added: (at obj23 pos1)
   goals met: 1 of 3
5. (unload-truck obj21 tru2 pos1)
   deleted: (in obj21 tru2)
   added: (at obj21 pos1)
   goals met: 1 of 3
6. (fly-airplane apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 1 of 3
7. (unload-airplane obj11 apn1 apt1)
   added: (at obj11 apt1)
   goals met: 2 of 3
8. (unload-airplane obj13 apn1 apt1)
   added: (at obj13 apt1)
   goals met: 3 of 3
